## 네트워킹과 웹 성능 최적화 기법

### 웹사이트 성능 3대 원칙 
* 웹사이트 빠를수록 사용자를 더 오래잡을 수 있다
* 웹사이트가 빠를수록 사용자의 재방문률이 높다
* 웹사이트가 빠를수록 사용자의 구매 전환율을 향상시킨다.

### 레이턴시(latency)
* 패킷 전송 지점부터 수신 지점까지 이동하는데 걸린 최종시간
* latency = propagation delay + transmission delay + processing delay + Queuing delay

#### 전파 지연
 * 메시지가 송신측에서 수신ㅊ측으로 이동하는데 필요한 시간. (총 이동거리대비 이동하는 속도로 측정)
 
#### 전송지연 
* 링크로 패킷의 모든 비트를 내보내는데 필요한 시간
* 패킷 길이 대비 링크의 데이터 전송속도로 측정

#### 프로세싱 지연 
* 라우터는 우선 패킷 해더를 처리한다
* 그리고 비트수준의 에러를 체크하며 패킷의 목적지를 알아낸다
* 이 과정에서의 시간을 프로세싱 지연이라 부른다.

#### 큐잉 지연
* 패킷이 큐에서 대기 시간
* 패킷이 라우터의 처리량보다 클 때, 보통 큐잉 버퍼에 대기한다
* 이 대기 시간이 큐잉지연이다.

#### 대역폭
* 논리적인, 물리적인 통신경로의 최대 처리량
